/*---------------------------------------------------------------------
                            睿龙科技协会

【平    台】RT1064
【编    写】林宏达
【联系方式】QQ：320388825 微信：LHD0617_
【最后更新】2021.02.24
【编译平台】MDK 5.28.0
【功    能】动力模块
【注意事项】本程序只供学习使用，未经作者许可，不得用于其它任何用途。
---------------------------------------------------------------------*/
#include "zf_pwm.h"
#include "Motor.h"


/*-----------------------------------------------------------
                       睿龙科技协会
                                  林宏达
【函数名称】：Motor_Init
【功    能】：动力PWM初始化
【传入参数】：无
【返回参数】：无
【实    例】：Motor_Init();
【注意事项】：无

-----------------------------------------------------------*/

void Motor_Init(void)
{
	pwm_init(Motor1_A, 12500, 0);
	pwm_init(Motor1_B, 12500, 0);
	pwm_init(Motor2_A, 12500, 0);
	pwm_init(Motor2_B, 12500, 0);
}


/*-----------------------------------------------------------
                       睿龙科技协会
                                  林宏达
【函数名称】：Motor_Ctrl
【功    能】：动力PWM输出
【传入参数】：num 电机编号 1-2    duty占空比  0-10000对应0%-100%
【返回参数】：无
【实    例】：Motor_Ctrl(1, 2000);
【注意事项】：无

-----------------------------------------------------------*/
void Motor_Ctrl(uint8 num, int16 duty)
{
	if(num==1)
	{
		if(duty>0)
		{
			pwm_duty(Motor1_A, 0);
			pwm_duty(Motor1_B, duty);
		}
		else
		{
			pwm_duty(Motor1_A, -duty);
			pwm_duty(Motor1_B, 0);
		}
	}
	if(num==2)
	{
		if(duty>0)
		{
			pwm_duty(Motor2_A, 0);
			pwm_duty(Motor2_B, duty);
		}
		else
		{
			pwm_duty(Motor2_A, -duty);
			pwm_duty(Motor2_B, 0);
		}
	}
}